// ========================
// ПАТТЕРНЫ (10 штук)
// ========================
const PATTERN_DOLBO =
  "[дД][аАaA@оО0oO][лЛ][бБ6][аАaA@оО0oO](?![яЯдД])[еЕёЁ][бБ6пП]";
const PATTERN_ZALUPA = "[зЗ3][аАaA@][лЛ][уУyY][пП]";
const PATTERN_PIDOR = "(?<![сС])[пП][иИ][дД][оО0oOаА@еЕ]?[рРpP]";
const PATTERN_PIZD = "(?<![уУэЭ]|[тТ][иИ])[пП][еЕиИ]?[зЗ3жЖ][дДтТ]";
const PATTERN_PIZH = "[пП][иИ][жЖ](?![\u0020аАоО])";
const PATTERN_MAND =
  "(?<![кК][аАоО0oO]|[аАтТ])[мМ][аАaA@][нН][дД](?![аА][лЛрРтТ]|[жЖрР][аАиИыЫ]|[еЕоО][лЛ])";
const PATTERN_HUI =
  "(?<![иИ]|[лЛрР][аАоО])[хХxX][уУyY¥][еЕёЁиИйЙлЛюЮяЯ](?![иИ][гГ]|[иИ][тТ][ьЬеЕ]|[аА])";
const PATTERN_BLYA = "(?<![аАмМуУюЮ]|[кКщЩ][еЕоО][рР])[бБ6][лЛ][@яЯ](?![шШ])";
const PATTERN_EBA =
  "(?<![бБвВгГдДжЖкКлЛмМнНпПрРсСтТцЦчЧшШщЗзЗ])[еЕёЁиИ][бБ6пП][аАaA@αΑеЕиИоО0oOуУyY]?([кКлЛнНрРсСтТчЧшШщЩыЫ\u0020\.,!?]|$)(?![еЕиИоОьЬхХ][еЕиИзЗкКшШчЧ]|[аАиИкКуУ][лЛоОсСтТпП][аАлЛоОпП\u0020\.,!?])";
const PATTERN_EBLO =
  "(?<![дДгГлЛнНпПрРсСтТчЧшШщЩ])[еЕёЁиИ][бБ6пП][лЛ][аАaA@оО0oO][нН]?";
const PATTERN_IBO =
  "(?<![\u0020аАгГкКлЛрРсСтТшШ])[иИ][бБ][оО](?![\u0020\.,!?;:])";

const regex = new RegExp(
  `(${[
    PATTERN_DOLBO,
    PATTERN_ZALUPA,
    PATTERN_PIDOR,
    PATTERN_PIZD,
    PATTERN_PIZH,
    PATTERN_MAND,
    PATTERN_HUI,
    PATTERN_BLYA,
    PATTERN_EBA,
    PATTERN_EBLO,
    PATTERN_IBO,
  ].join("|")})`,
  "g",
);
