// ========================
// ПАТТЕРНЫ (10 штук)
// ========================
const PATTERN_DOLBO =
  "[дД][аАaA@оО0oO][лЛ][бБ6][аАaA@оО0oO](?![яЯдД])[еЕёЁ][бБ6пП]";
const PATTERN_ZALUPA = "[зЗ3][аАaA@][лЛ][уУyY][пП]";
const PATTERN_PIDOR = "(?<![сС])[пП][иИ][дД][оО0oOаА@еЕ]?[рРpP]";
const PATTERN_PIZD =
  "(?<![аАэЭ]|[тТ][иИ])[пП][еЕиИ][жЖзЗ3][дДтТ]?(?![аА][мМ]|[нН]|[\u0020])";
const PATTERN_MAND =
  "(?<![кК][аАоО0oO]|[тТ])[мМ][аАaA@][нН][дД](?![аА][лЛрРтТ]|[жЖрР][аАиИыЫ]|[еЕ][лЛ])";
const PATTERN_HUI =
  "(?<![иИ])[хХxX][уУyY¥][еЕёЁиИйЙлЛюЮяЯ](?![иИ][гГ]|[иИ][тТ][ьЬеЕ]|[аА])";
const PATTERN_BLYA = "(?<![аАеЕмМрРуУюЮ])[бБ6][лЛ][@яЯ](?![шШ])";
const PATTERN_EBA =
  "(?<![бБвВгГдДжЖкКлЛмМнНоОрРсСтТцЦчЧшШщЩ])[еЕёЁиИ][бБ6пП][аАaA@αΑеЕиИоО0oOуУyY]?[кКлЛнНрРсСтТшШщЩ](?![еЕ][еЕзЗкКчЧ]|[аАиИ][тТ][оО\u0020\.,!?]|[уУ][лЛ]|[хХ][иИ])";
const PATTERN_EBLO =
  "(?<![дДгГнНпПрРтТчЧшШщЩ])[еЕёЁиИ][бБ6пП][лЛ][аАaA@оО0oO][нН]?";
const PATTERN_IBO =
  "(?<![\u0020аАгГкКлЛрРсСтТшШ])[иИ][бБ][оО](?![\u0020\.,!?;:])";

// Объединённая регулярка
const regex = new RegExp(
  `(${[
    PATTERN_DOLBO,
    PATTERN_ZALUPA,
    PATTERN_PIDOR,
    PATTERN_PIZD,
    PATTERN_MAND,
    PATTERN_HUI,
    PATTERN_BLYA,
    PATTERN_EBA,
    PATTERN_EBLO,
    PATTERN_IBO,
  ].join("|")})`,
  "g",
);
