const PATTERN_DOLBO = '[дД][аАaA@оО0oO][лЛ][бБ6][аАaA@оО0oO](?![яЯдД])[еЕёЁ][бБ6пП]';
const PATTERN_ZALUPA = '[зЗ3][аАaA@][лЛ][уУyY][пП]';
const PATTERN_PIDOR = '(?<![иИ])[пП][иИэЭ][дД][оО0oOаА@еЕэЭ]?[рРpP](?![дД]|[иИ](\\s|[.,!?]|$))';
const PATTERN_PITER = '(?<![еЕюЮ])[пП][иИ][тТ][аА@еЕ]?[рР](?![иИсСуУ]|[аАеЕ](\\s|[.,!?]|$)|(\\s|[.,!?]|$))';
const PATTERN_PIZD = '(?<![уУэЭ]|[тТ][иИ])[пП][еЕиИ]?[зЗ3жЖ][ьЬ]?[дДтТ]';
const PATTERN_PISD = '(?<![оО])[пП][еЕиИ]?[сС][дДтТ](?![кКрР]|[еЕиИ][йЙкК]|[оО][лЛ]|[рРуУ][аАюЮ][нНтТ]|[оО][лЛ][еЕ][тТ])';
const PATTERN_PIZH = '[пП][иИ][жЖ](?![\u0020аАоО])';
const PATTERN_MAND = '(?<![кК][аАоО0oO]|[аАтТ])[мМ][аАaA@][нН][ьЬ]?[дД](?![аА][лЛрРтТ]|[жЖрР][аАиИоОыЫ]|[еЕоО][бБлЛ])';
const PATTERN_HUI = '(?<![уУ]|[гГлЛ][оО]|(^|\\s)[тТ][иИ])[хХxX][уУyY¥][еЕёЁиИлЛюЮяЯ](?![аА]|[иИ][гГ]|[иИ][тТшШ][ьЬеЕ])';
const PATTERN_HUY = '(?<![сС][тТ][рР][аА])[хХ][уУ][йЙ](?!(|\\s|[.,!?]|$))';
const PATTERN_BLYA = '(?<![аАмМуУюЮ]|[дДсСтТ][еЕоО]|[кКщЩ][еЕоО][рР]|[иИ][сС][тТ][рР][еЕ]|[уУ][пП][оО][тТ][рР][еЕ])[бБ6][лЛ][@яЯ][дД]?(?![еЕ])';
const PATTERN_PLYA = '(?<![аАеЕиИмМыЫ])[пП][лЛ][@яЯ](?![шШжЖюЮ])';
const PATTERN_EBA = '(?<![бБвВгГдДжЖлЛмМнНпПрРсСтТчЧшШщЩЗзЗ])[еЕёЁ][бБ6][аАaA@αΑеЕиИ0оОoOуУyY$]?([бБкКлЛнНсСтТчЧшШщЩыЫ]|\\s|[.,!?]|$)(?![еЕиИоОьЬхХ][еЕиИзЗкКшШчЧ]|[иИкКуУ][лЛоОтТпП][аАлЛоОпП\u0020\.,!?])';
const PATTERN_IBI = '(?<![дДрРтТшШ])[иИ][бБ][иИ](?![рР])';
const PATTERN_EBLO = '(?<![дДгГлЛнНпПрРсСтТчЧшШщЩ])[еЕёЁиИэЭ][бБ6пП][лЛ][аАaA@оО0oO][нН]?(?![йЙ])';
const PATTERN_IPA = '(?<![гГзЗкКлЛнНпПрРтТцЦжЖшШщЩ])[иИеЕ][пП][аА](?![рРмМчЧ])';

const regex = new RegExp(
  `(${[
    PATTERN_DOLBO,
    PATTERN_ZALUPA,
    PATTERN_PIDOR,
    PATTERN_PITER,
    PATTERN_PIZD,
    PATTERN_PISD,
    PATTERN_PIZH,
    PATTERN_MAND,
    PATTERN_HUI,
    PATTERN_HUY,
    PATTERN_BLYA,
    PATTERN_PLYA,
    PATTERN_EBA,
    PATTERN_IBI,
    PATTERN_EBLO,
    PATTERN_IPA
  ].join('|')})`,
  'g'
);