const PATTERN_BLYAD = '(?<![аАмМюЮ]|[дДрР][уУ]|[дДсСтТ][еЕоО]|[гГкКоОщЩ][оОрРеЕ][еЕрРоО]|[иИ][сС][тТ][рР][еЕ]|[уУ][пП][оО][тТ][рР][еЕ])[бБьЬ6ⳝ][лЛ][@яЯ][дД]?(?![еЕлЛмМпПсСтТшШюЮяЯ])';
const PATTERN_BLYAT = '(?<![уУ]|[рРдД][оО]|[кК][оО][рР]|[аАоО][сС]{1,2}[лЛ][аА]|[иИпП][оОсС][тТ][рР][еЕ])[бБ6ⳝ][лЛ][яЯ][тТ]';
const PATTERN_DOLBO = '[дД][аАaA@оО0oO][лЛ][бБ6ⳝ][аАaA@оО0oO](?![яЯдД])[еЕёЁ][бБ6пП]';
const PATTERN_EB = '(?<![вВгГдДзЗкКлЛнНпПрРсСтТцЦчЧшШщЩ])[еЕёЁëË][бБⳝпП](?![аАеЕиИлЛнНоОрРсСтТшШ])';
const PATTERN_EBA = '(?<![бБвВгГдДжЖкКлЛмМнНпПрРсСтТцЦчЧшШщЩЗзЗcCdDrRsStTmM]|[вВ][оО])[еЕeEёЁëε][бБьЬ6δⳝb][аАaA@αАеЕёЁиИμлЛнН0оОoOуУyYыЫ][рРвВеЕйЙнНрРуУyжЖлЛӆбБкКоОтТчЧшШщЩ]?(?![ҙ]|[сС][оО])'; // |[еЕсСьЬхХ][еЕиИзЗкКнНшШчЧ]|[иИкКнНуУ][лЛоОтТпП][еЕлЛоОпП]
const PATTERN_EBLO = '(?<![бБвВдДгГлЛнНпПрРсСтТчЧшШщЩ])[еЕёЁиИэЭ][бБ6ⳝпП][лЛ][аАaA@оО0oO][нН]?(?![йЙкК])';
const PATTERN_HUI = '(?<![уУ]|[гГлЛ][оО]|(^|\\s|[вВ])[лЛтТ][иИ])[хХxX×][уУyY¥][ёЁëËиИлЛ](?![аАуУыЫ]|[иИ][гГоОьЬяЯ]|[иИ][тТшШ][ьЬеЕ])';
const PATTERN_HUY = '(?<![кК]|[лЛсСтТ][иИуУоО]|[сС][тТ][рР][аА])[хХxX×ⲭχ][уУyY¥ⲩγ][еЕ3йЙÑύюЮяЯ]';
const PATTERN_HUYN = '[хХxX×][уУyY¥][йЙÑ][нН]';
const PATTERN_IBI = '(?<![бБвВГгдДкКлЛмМнНпПсСрРтТшШчЧхХцЦфФқҚ])[иИμ][бБⳝ][аАеЕиИμуУ](?![рРсСцЦ])';
const PATTERN_IPA = '(?<![вВдДгГзЗиИкКлЛнмМНпПрРсСтТцЦжЖхХчЧшШщЩ])[иИеЕ][пП][аАеЕёЁиИ](?![рРмМчЧфФ]|[нН][чЧ]|[тТ][иИ]|[тТсС][ьЬкК][еЕоО][вВпП])';
const PATTERN_MAND = '(?<![кК][аАсСоО]|[аАиИлЛрРтТ])[мМ][аАaA@][нН][ьЬ]?[дД](?![аАиИ][лЛрРтТ]|[жЖрР][аАиИоОыЫ]|[еЕоО][бБлЛ])';
const PATTERN_PIDOR = '(?<![аАиИкК4])[пП][иИэЭ]?[дД][оО0oOаА@еЕэЭ]?[рРpPrR\\s](?![дД]|[аА][нН]|[иИ](\\s|[.,!?]))';
const PATTERN_PEST = '[пП][еЕ][сС][дДтТ](?![кКоОрР]|[иИеЕуУ][кКлЛнНцЦшШ]|[уУ][юЮ][тТ])';
const PATTERN_PISD = '(?<![мМоОЯя]|[кКрР][аА])[пП][иИ]?[сС][дДтТ](?![вВ]|[еЕ][йЙрР]|[оО][лЛнНрР]|[рР][аА][нН]|[оО][лЛ][еЕ][тТ])';
const PATTERN_PITАR = '(?<![оО])[пП][иИ][тТ][аА@оО]?[рР](?![иИ])';
const PATTERN_PITER = '(?<![еЕоОюЮ(])[пП][иИ][тТ][еЕ]?[рР](?![бБиИоОсСуУцЦ)]|[аАеЕ":;»](\\s|[.,!?])|\\s|[.,!?])';
const PATTERN_PIZD = '(?<![эЭ]|[тТ][иИ])[пП5π][еЕиИNыЫ]?[зЗ3жЖzZ]{1,2}[ьЬ]?[дДлЛтТ](?![еЕ][сС][ьЬ])';
const PATTERN_PIZH = '[пП][иИ][жЖ](?![\u0020аАмМоО])';
const PATTERN_PLYA = '(?<![аАиИоОмМуУыЫ]|[цЦщЩ][еЕ]|[кК][рР][еЕ])[пП][лЛ][@яЯ](?![жЖсСшШюЮ])';
const PATTERN_ZALUPA = '[зЗ3][аАaA@][лЛ][уУyY][пП]';

const regex = new RegExp(
    `(${[
        PATTERN_BLYAD,
        PATTERN_BLYAT,
        PATTERN_DOLBO,
        PATTERN_EB,
        PATTERN_EBA,
        PATTERN_EBLO,
        PATTERN_HUI,
        PATTERN_HUY,
        PATTERN_HUYN,
        PATTERN_IBI,
        PATTERN_IPA,
        PATTERN_MAND,
        PATTERN_PIDOR,
        PATTERN_PEST,
        PATTERN_PISD,
        PATTERN_PITАR,
        PATTERN_PITER,
        PATTERN_PIZD,
        PATTERN_PIZH,
        PATTERN_PLYA,
        PATTERN_ZALUPA
    ].join('|')})`,
    'g'
);