const PATTERN_BLYAD = '(?<![аАмМюЮ]|[дДрР][уУ]|[дДсСтТ][еЕоО]|[кКоОуУщЩ][гГоОеЕ][рРоОуУ]|[гГ][рРлЛ][еЕоО])[бБьЬ6ⳝ][лЛ][@яЯ][дД]?(?![еЕлЛмМпПсСтТшШюЮяЯ])';
const PATTERN_BLYAT = '(?<![уУ]|[рРдД][оО]|[вВкК][лЛоО][рРюЮ]|[аАоО][сС]{1,2}[лЛ][аА]|[иИпП][оОсС][тТ][рР][еЕ])[бБ6ⳝ][лЛ][@яЯ][тТяЯ]';
const PATTERN_DOLBO = '[дД][аАaA@оО0oO][лЛ][бБ6ⳝ][аАaA@оО0oO](?![яЯдД])[еЕёЁ][бБ6пП]';
const PATTERN_EB = '(?<![бБвВгГдДзЗкКлЛмМнНпПрРсСтТцЦчЧшШщЩ])[еЕёЁëËе][бБⳝпП](?![аАеЕиИлЛнНоОрРсСтТшШ])';
const PATTERN_EBA = '(?<![бБгГдДжЖкКлЛмМнНпПрРсСтТцЦчЧшШщЩЗзЗcCdDrRsStTmMwW]|[aAвВ][lLоО])[еЕeEёЁëε][бБьЬ6δⳝb][аАaA@αАеЕёЁиИμлЛнН0оОoOуУyYыЫ][рРвВеЕйЙнНрРуУyжЖлЛӆбБкКоОтТчЧшШщЩ]?(?![ҙ\\s]|[аАнНсС][аАоОрР])';
const PATTERN_EBLO = '(?<![бБвВдДгГлЛнНпПрРсСтТчЧшШщЩ])[еЕёЁиИэЭ][бБ6ⳝпП][лЛ][аАaA@оО0oO][нН]?(?![йЙкК])';
const PATTERN_HUI = '(?<![уУ]|[гГлЛ][оО]|(^|\\s|[вВ])[лЛтТ][иИ])[хХxX×][уУyY¥][ёЁëËиИлЛ](?![аАуУыЫьЬ]|[иИ][гГоОьЬяЯ]|[иИ][тТшШ][ьЬеЕ])';
const PATTERN_HUY = '(?<![кК]|[лЛсСтТ][иИуУоО]|[сС][тТ][рР][аА])[хХxX×ⲭχ][уУyY¥ⲩγ][еЕ3йЙÑύюЮяЯ]';
const PATTERN_HUYN = '[хХxX×][уУyY¥][йЙÑ][нН]';
const PATTERN_IBI = '(?<![бБвВГгдДжЖкКлЛмМнНпПсСрРтТшШчЧхХцЦфФқҚ])[иИμ][бБⳝ][аАеЕиИμуУ](?![рРсСцЦ])';
const PATTERN_IPA = '(?<![вВдДгГзЗиИкКлЛнмМНпПрРсСтТцЦжЖхХчЧшШщЩ])[иИеЕ][пП][аАеЕёЁиИ](?![рРмМчЧфФ]|[нН][чЧ]|[тТ][иИ]|[сС][кК]|[тТ][ьЬ][еЕ][вВ])';
const PATTERN_MAND = '(?<![кК][аАсСоО]|[аАиИлЛрРтТ])[мМ][аАaA@][нН][ьЬ]?[дД](?![аАиИ][лЛрРтТ]|[жЖрР][аАиИоОыЫ]|[еЕоО][бБлЛ])';
const PATTERN_PIDOR = '(?<![аАиИкК4]|[уУ][сС])[пП][иИэЭ]?[дД][оО0oOаА@еЕэЭ]?[рРpPrR\\s](?![дД]|[аА][нН]|[иИ](\\s|[.,!?]))';
const PATTERN_PEST = '[пП][еЕ][сС][дДтТ](?![кКоОрР]|[еЕиИуУ][кКлЛнНшШ]|[иИуУ][еЕцЦюЮ][иИмМтТ])';
const PATTERN_PISD = '(?<![мМоОЯя]|[кКрР][аА])[пП][иИ]?[сС][дДтТ](?![вВ]|[аАеЕ][зЗйЙрР]|[оО][лЛнНрР]|[рР][аА][нН]|[оО][лЛ][еЕ][тТ])';
const PATTERN_PITАR = '(?<![оО])[пП][иИ][тТ][аА@оО]?[рР](?![иИ])';
const PATTERN_PITER = '(?<![еЕоОюЮ(])[пП][иИ][тТ][еЕ]?[рР](?![бБеЕиИоОсСуУцЦ)]|[аАеЕ":;»/](\\s|[.,!?/]|$)|\\s|[.,!?/]|$)';
const PATTERN_PIZD = '(?<![тТ][иИ])[пП5π][еЕёЁëЁиИNыЫ]?[зЗ3жЖzZ]{1,2}[ьЬ]?[дДлЛтТ](?![еЕ][сС][ьЬ])';
const PATTERN_PIZH = '[пП][иИ][жЖ](?![\u0020аАмМоО])';
const PATTERN_PLYA = '(?<![аАиИоОмМуУыЫ]|[лЛтТцЦщЩ][еЕ]|[кК][рР][еЕ])[пП][лЛ][@яЯ](?![жЖкКсСшШюЮ])';
const PATTERN_ZALUPA = '[зЗ3][аАaA@][лЛ][уУyY][пП]';

const regex = new RegExp(
    `(${[
        PATTERN_BLYAD,
        PATTERN_BLYAT,
        PATTERN_DOLBO,
        PATTERN_EB,
        PATTERN_EBA,
        PATTERN_EBLO,
        PATTERN_HUI,
        PATTERN_HUY,
        PATTERN_HUYN,
        PATTERN_IBI,
        PATTERN_IPA,
        PATTERN_MAND,
        PATTERN_PIDOR,
        PATTERN_PEST,
        PATTERN_PISD,
        PATTERN_PITАR,
        PATTERN_PITER,
        PATTERN_PIZD,
        PATTERN_PIZH,
        PATTERN_PLYA,
        PATTERN_ZALUPA
    ].join('|')})`,
    'g'
);