const PATTERN_BLYAD = '(?<![аАмМюЮ]|[рР][уУ]|[дДсСтТ][еЕоО]|[гГщЩ][рРеЕ][еЕрР]|[иИ][сС][тТ][рР][еЕ]|[уУ][пП][оО][тТ][рР][еЕ])[бБ6][лЛ][@яЯ][дД]?(?![еЕлЛпПтТюЮ])';
const PATTERN_BLYAT = '(?<![рР][оО]|[кК][оО][рР]|[уУ]|[пП][оО][тТ][рР][еЕ])[бБ6][лЛ][яЯ][тТ]';
const PATTERN_DOLBO = '[дД][аАaA@оО0oO][лЛ][бБ6][аАaA@оО0oO](?![яЯдД])[еЕёЁ][бБ6пП]';
const PATTERN_EBA = '(?<![бБвВгГдДжЖкКлЛмМнНпПрРсСтТчЧшШщЩЗзЗ])[еЕeEёЁë][бБ6][аАaA@αΑеЕёЁиИнН0оОoOуУyY$]?([еЕйЙнНмМуУyжЖлЛбБкКоОсСтТчЧшШщЩыЫ]|\\s|[.,!?]|$)(?![еЕсСьЬхХ][еЕиИзЗкКнНшШчЧ]|[иИкКнНуУ][лЛоОтТпП][еЕлЛоОпП])';
const PATTERN_EBLO = '(?<![бБдДгГлЛнНпПрРсСтТчЧшШщЩ])[еЕёЁиИэЭ][бБ6пП][лЛ][аАaA@оО0oO][нН]?(?![йЙ])';
const PATTERN_HUI = '(?<![уУ]|[гГлЛ][оО]|(^|\\s)[лЛтТ][иИ])[хХxX][уУyY¥][ёЁиИлЛюЮ](?![аА]|[иИ][гГоО]|[иИ][тТшШ][ьЬеЕ])';
const PATTERN_HUY = '(?<![кК]|[лЛсС][иИ]|[сС][тТ][рР][аА])[хХ][уУ][еЕйЙяЯ]';
const PATTERN_HUYN = '[хХ][уУ][йЙ][нН]';
const PATTERN_IBI = '(?<![бБгГдДкКлЛпПсСрРтТшШчЧцЦ])[иИ][бБпП][иИ](?![рР])';
const PATTERN_IPA = '(?<![дДгГзЗкКлЛнНпПрРтТцЦжЖшШщЩ])[иИеЕ][пП][аА](?![рРмМчЧ]|[нН][чЧ]|[тТ][ьЬ][еЕ][вВ])';
const PATTERN_MAND = '(?<![кК][аАоО0oO]|[аАрРтТ])[мМ][аАaA@][нН][ьЬ]?[дД](?![аА][лЛрРтТ]|[жЖрР][аАиИоОыЫ]|[еЕоО][бБлЛ])';
const PATTERN_PIDOR = '(?<![иИ])[пП][иИэЭ]?[дД][оО0oOаА@еЕэЭ]?[рРpP](?![дД]|[аА][нН]|[иИ](\\s|[.,!?]|$))';
const PATTERN_PISD = '(?<![оОЯя])[пП][еЕиИ]?[сС][дДтТ](?![вВкКрР]|[еЕиИ][йЙкК]|[оО][лЛнНрР]|[рРуУ][аАюЮ][нНтТ]|[оО][лЛ][еЕ][тТ])';
const PATTERN_PITАR = '[пП][иИ][тТ][аА@оО][рР]';
const PATTERN_PITER = '(?<![еЕюЮ])[пП][иИ][тТ][еЕ]?[рР](?![иИсСуУ]|[аАеЕ":;](\\s|[.,!?]|$)|\\s|[.,!?]|$)';
const PATTERN_PIZD = '(?<![эЭ]|[тТ][иИ])[пП][еЕиИыЫ]?[зЗ3жЖ][ьЬ]?[дДтТ]';
const PATTERN_PIZH = '[пП][иИ][жЖ](?![\u0020аАоО])';
const PATTERN_PLYA = '(?<![аАеЕиИоОмМуУыЫ])[пП][лЛ][@яЯ](?![жЖсСшШюЮ])';
const PATTERN_ZALUPA = '[зЗ3][аАaA@][лЛ][уУyY][пП]';

const regex = new RegExp(
    `(${[
        PATTERN_BLYAD,
        PATTERN_BLYAT,
        PATTERN_DOLBO,
        PATTERN_EBA,
        PATTERN_EBLO,
        PATTERN_HUI,
        PATTERN_HUY,
        PATTERN_HUYN,
        PATTERN_IBI,
        PATTERN_IPA,
        PATTERN_MAND,
        PATTERN_PIDOR,
        PATTERN_PISD,
        PATTERN_PITАR,
        PATTERN_PITER,
        PATTERN_PIZD,
        PATTERN_PIZH,
        PATTERN_PLYA,
        PATTERN_ZALUPA
    ].join('|')})`,
    'g'
);