const PATTERN_DOLBO = '[дД][аАaA@оО0oO][лЛ][бБ6][аАaA@оО0oO](?![яЯдД])[еЕёЁ][бБ6пП]';
const PATTERN_ZALUPA = '[зЗ3][аАaA@][лЛ][уУyY][пП]';
const PATTERN_PIDOR = '(?<![иИсС])[пП][иИэЭ][дД][оО0oOаА@еЕэЭ]?[рРpP](?![дД]|[иИ](\\s|[.,!?]|$))';
const PATTERN_PITER = '(?<![еЕюЮ])[пП][иИ][тТ][аА@еЕ]?[рР](?![иИсСуУ]|[аА][\\s|[.,!?]|$]|(\\s|[.,!?]|$))';
const PATTERN_PIZD = '(?<![уУэЭ]|[тТ][иИ])[пП][еЕиИ]?[зЗ3жЖ][ьЬ]?[дДтТ]';
const PATTERN_PISD = '[пП][еЕиИ]?[сС][дДтТ](?![оОкК]|[еЕиИ][йЙкК]|[уУ][юЮ][тТ]|[оО][лЛ][еЕ][тТ])';
const PATTERN_PIZH = '[пП][иИ][жЖ](?![\u0020аАоО])';
const PATTERN_MAND = '(?<![кК][аАоО0oO]|[аАтТ])[мМ][аАaA@][нН][ьЬ]?[дД](?![аА][лЛрРтТ]|[жЖрР][аАиИоОыЫ]|[еЕоО][бБлЛ])';
const PATTERN_HUI = '(?<![иИоОуУ]|[гГлЛрР][аАоО])[хХxX][уУyY¥][еЕёЁиИйЙлЛюЮяЯ](?![иИ][гГ]|[иИ][тТ][ьЬеЕ]|[аА])';
const PATTERN_BLYA = '(?<![аАмМоОуУюЮ]|[кКщЩ][еЕоО][рР]|[рРтТ][еЕ])[бБ6пП][лЛ][@яЯ](?![еЕшШжЖюЮ])';
const PATTERN_EBA = '(?<![бБвВгГдДжЖлЛмМнНпПрРсСтТчЧшШщЩЗзЗ])[еЕёЁ][бБ6][аАaA@αΑеЕиИ0оОoOуУyY]?([бБкКлЛнНрРсСтТчЧшШщЩыЫ]|\\s|[.,!?]|$)(?![еЕиИоОьЬхХ][еЕиИзЗкКшШчЧ]|[иИкКуУ][лЛоОтТпП][аАлЛоОпП\u0020\.,!?])';
const PATTERN_EBLO = '(?<![дДгГлЛнНпПрРсСтТчЧщЩ])[еЕёЁиИэЭ][бБ6пП][лЛ][аАaA@оО0oO][нН]?';
const PATTERN_IPA = '(?<![гГзЗкКлЛпПрРтТцЦшШщЩ])[иИеЕ][пП][аА](?![рРмМчЧ])';
//const PATTERN_IBO = '(?<![\u0020аАгГкКлЛрРсСтТшШ])[иИ][бБ][оО](?![\u0020\.,!?;:])';

const regex = new RegExp(
  `(${[
    PATTERN_DOLBO,
    PATTERN_ZALUPA,
    PATTERN_PIDOR,
    PATTERN_PITER,
    PATTERN_PIZD,
    PATTERN_PISD,
    PATTERN_PIZH,
    PATTERN_MAND,
    PATTERN_HUI,
    PATTERN_BLYA,
    PATTERN_EBA,
    PATTERN_EBLO,
    PATTERN_IPA,
    //PATTERN_IBO,
  ].join('|')})`,
  'g'
);