const PATTERN_BLYAD = '(?<![аАмМюЮ]|[дДрР][уУ]|[дДсСтТ][еЕоО]|[гГкКоОщЩ][оОрРеЕ][еЕрРоО]|[иИ][сС][тТ][рР][еЕ]|[уУ][пП][оО][тТ][рР][еЕ])[бБ6][лЛ][@яЯ][дД]?(?![еЕлЛпПтТшШюЮяЯ])';
const PATTERN_BLYAT = '(?<![уУ]|[рРдД][оО]|[кК][оО][рР]|[оО][сС][лЛ][аА]|[иИпП][оОсС][тТ][рР][еЕ])[бБ6][лЛ][яЯ][тТ]';
const PATTERN_DOLBO = '[дД][аАaA@оО0oO][лЛ][бБ6][аАaA@оО0oO](?![яЯдД])[еЕёЁ][бБ6пП]';
const PATTERN_EB = '(?<![вВгГдДкКлЛнНпПрРсСтТцЦчЧшШ])[еЕёЁ][бБпП](?![аАеЕиИлЛнНоОрРсСтТ])';
const PATTERN_EBA = '(?<![бБвВгГдДжЖкКлЛмМнНпПрРсСтТчЧшШщЩЗзЗ]|[вВ][оО])[еЕeEёЁë][бБ6δ][аАaA@αАеЕёЁиИлЛнН0оОoOуУyYыЫ][рРвВеЕйЙнНрРуУyжЖлЛӆбБкКоОтТчЧшШщЩ]?(?![ҙ]|[сС][оО])'; // |[еЕсСьЬхХ][еЕиИзЗкКнНшШчЧ]|[иИкКнНуУ][лЛоОтТпП][еЕлЛоОпП]
const PATTERN_EBLO = '(?<![бБвВдДгГлЛнНпПрРсСтТчЧшШщЩ])[еЕёЁиИэЭ][бБ6пП][лЛ][аАaA@оО0oO][нН]?(?![йЙ])';
const PATTERN_HUI = '(?<![уУ]|[гГлЛ][оО]|(^|\\s|[вВ])[лЛтТ][иИ])[хХxX×][уУyY¥][ёЁиИлЛюЮ](?![аАуУыЫ]|[иИсС][гГоОьЬяЯ]|[иИ][тТшШ][ьЬеЕ])';
const PATTERN_HUY = '(?<![кК]|[лЛсС][иИ]|[сС][тТ][рР][аА])[хХxX×][уУyY¥][еЕйЙÑяЯ]';
const PATTERN_HUYN = '[хХxX×][уУyY¥][йЙÑ][нН]';
const PATTERN_IBI = '(?<![бБвВГгдДкКлЛнНпПсСрРтТшШчЧцЦфФ])[иИ][бБ][еЕиИуУ](?![рРсС])';
const PATTERN_IPA = '(?<![дДгГзЗиИкКлЛнмМНпПрРсСтТцЦжЖхХчЧшШщЩ])[иИеЕ][пП][аАеЕёЁиИ](?![рРмМчЧ]|[нН][чЧ]|[тТ][иИ]|[тТсС][ьЬкК][еЕоО][вВпП])';
const PATTERN_MAND = '(?<![кК][аАсСоО]|[аАиИрРтТ])[мМ][аАaA@][нН][ьЬ]?[дД](?![аАиИ][лЛрРтТ]|[жЖрР][аАиИоОыЫ]|[еЕоО][бБлЛ])';
const PATTERN_PIDOR = '(?<![иИ4])[пП][иИэЭ]?[дД][оО0oOаА@еЕэЭ]?[рРpP\\s](?![дД]|[аА][нН]|[иИ](\\s|[.,!?]))';
const PATTERN_PEST = '[пП][еЕ][сС][тТ](?![кКоОрР]|[иИеЕ][кКлЛцЦ]|[уУ][юЮ][тТ])';
const PATTERN_PISD = '(?<![мМоОЯя]|[кКрР][аА])[пП][иИ]?[сС][дДтТ](?![вВ]|[еЕ][йЙрР]|[оО][лЛнНрР]|[рР][аА][нН]|[оО][лЛ][еЕ][тТ])';
const PATTERN_PITАR = '[пП][иИ][тТ][аА@оО]?[рР](?![иИ])';
const PATTERN_PITER = '(?<![еЕюЮ(])[пП][иИ][тТ][еЕ]?[рР](?![бБиИсСуУ)]|[аАеЕ":;](\\s|[.,!?])|\\s|[.,!?])';
const PATTERN_PIZD = '(?<![эЭ]|[тТ][иИ])[пП5π][еЕиИыЫ]?[зЗ3жЖ][ьЬ]?[дДтТ](?![еЕ][сС])';
const PATTERN_PIZH = '[пП][иИ][жЖ](?![\u0020аАмМоО])';
const PATTERN_PLYA = '(?<![аАеЕиИоОмМуУыЫ])[пП][лЛ][@яЯ](?![жЖсСшШюЮ])';
const PATTERN_ZALUPA = '[зЗ3][аАaA@][лЛ][уУyY][пП]';

const regex = new RegExp(
    `(${[
        PATTERN_BLYAD,
        PATTERN_BLYAT,
        PATTERN_DOLBO,
        PATTERN_EB,
        PATTERN_EBA,
        PATTERN_EBLO,
        PATTERN_HUI,
        PATTERN_HUY,
        PATTERN_HUYN,
        PATTERN_IBI,
        PATTERN_IPA,
        PATTERN_MAND,
        PATTERN_PIDOR,
        PATTERN_PEST,
        PATTERN_PISD,
        PATTERN_PITАR,
        PATTERN_PITER,
        PATTERN_PIZD,
        PATTERN_PIZH,
        PATTERN_PLYA,
        PATTERN_ZALUPA
    ].join('|')})`,
    'g'
);